[
 {
   "Choice": "Javascript",
   "Level": "Absolute Beginner",
   "Concept": "Variables",
   "Definition": "Variables in JavaScript are containers that hold data values and can be used to store and manipulate information within a program.",
   "Projects": "1. Simple Calculator: Create a basic calculator that takes two numbers as input and performs basic arithmetic operations such as addition, subtraction, multiplication, and division. Use variables to store the input values and the result.###2. Temperature Converter: Build a temperature converter that converts between Celsius and Fahrenheit. Allow the user to input a temperature in one unit and display the converted value in the other unit. Use variables to store the input value and the converted result.###3. Random Quote Generator: Develop a program that generates random quotes or phrases when a button is clicked. Store a collection of quotes in an array using variables, and randomly select one to display each time the button is pressed.",
   "Icons": "calculator, thermometer-half, quote-right"
  },
 {
   "Choice": "Javascript",
   "Level": "Intermediate",
   "Concept": "Functions",
   "Definition": "Functions in JavaScript are blocks of reusable code that can be called and executed to perform a specific task.",
   "Projects": "1. Calculator: Build a simple calculator that can perform basic arithmetic operations such as addition, subtraction, multiplication, and division. Use functions to encapsulate the logic for each operation and display the result on the webpage.###2. To-Do List: Create a to-do list application where users can add, delete, and mark tasks as completed. Use functions to handle these actions and update the list dynamically on the webpage.###3. Random Quote Generator: Develop a program that displays random quotes on a webpage. Use functions to store an array of quotes and generate a random quote each time the page is refreshed or a button is clicked.",
   "Icons": "calculator, check-square, quote-right"
 },
 {
   "Choice": "Javascript",
   "Level": "Advanced",
   "Concept": "Asynchronous Programming",
   "Definition": "Asynchronous programming in the context of JavaScript refers to the ability to execute tasks or operations concurrently without blocking the main execution thread. In JavaScript, this is particularly important because it's a single-threaded language, meaning it can only execute one operation at a time on the main thread. Asynchronous programming allows you to perform tasks like fetching data from a server, reading files, or waiting for user input without freezing the user interface or causing delays.",
   "Projects": "1. Weather App: Create a simple weather application that fetches weather data from an API asynchronously. Users can enter their location, and the app will display the current weather conditions, temperature, and other relevant information.###2. To-Do List: Build a to-do list application that allows users to add, edit, and delete tasks asynchronously. Implement features like marking tasks as completed, setting due dates, and organizing tasks into different categories.###3. Image Gallery: Develop an image gallery where users can upload and view images asynchronously. Include features like image uploading, image search functionality, and the ability to view images in a slideshow format.",
   "Icons": "cloud-sun, check-square, image"
 },
 {
   "Choice": "Web Development",
   "Level": "Absolute Beginner",
   "Concept": "HTML",
   "Definition": "HTML stands for Hypertext Markup Language and is the standard language used for creating and structuring web pages.",
   "Projects": "1. Personal Portfolio Website:- Create a simple website to showcase your skills, projects, and experiences.- Include sections like an about me, portfolio, contact information, and links to your social media profiles.- Practice using HTML tags to structure the content and CSS for styling.###2. Blogging Website:- Build a basic blogging platform where you can create, edit, and publish blog posts.- Include features like a homepage displaying recent posts, individual post pages with comments, and an archive page.- Utilize HTML for structuring the layout, CSS for styling, and possibly JavaScript for interactivity.###3. Product Landing Page:- Design a landing page for a fictional product or service.- Include sections like product description, features, pricing, testimonials, and a call-to-action button.- Apply HTML to structure the page elements, CSS for styling and layout design, and potentially add some interactivity using JavaScript.",
   "Icons": "user-circle, pen-square, shopping-cart"
  },
 {
   "Choice": "Web Development",
   "Level": "Intermediate",
   "Concept": "Frameworks",
   "Definition": "Frameworks in web development are pre-written code libraries that provide a structure and set of tools to simplify and speed up the process of building websites or web applications.",
   "Projects": "1. Personal Portfolio Website:- Build a personal portfolio website to showcase your skills and projects.- Use a framework like React or Angular to create a dynamic and interactive user interface.- Include sections for your bio, resume, projects, and contact information.###2. Blogging Platform:- Create a blogging platform where users can create, edit, and publish blog posts.- Use a framework like Django or Ruby on Rails to handle the backend logic and database management.- Implement features like user authentication, commenting system, and search functionality.###3. E-commerce Store:- Develop an e-commerce store where users can browse products, add them to cart, and make purchases.- Utilize a framework like Laravel or ASP.NET to handle the backend functionalities such as product management, inventory tracking, and payment integration.- Implement features like user registration, product search/filtering, shopping cart functionality, and order tracking.",
   "Icons": "user-circle, pen-square, shopping-cart"
 },
 {
   "Choice": "Web Development",
   "Level": "Advanced",
   "Concept": "Responsive Design",
   "Definition": "Responsive Design focuses on creating websites that adapt and display properly across different devices and screen sizes.",
   "Projects": "1. Personal Portfolio Website: Build a responsive website to showcase your skills, projects, and experience. Include sections for your resume, portfolio, and contact information. This project will help you practice implementing responsive design principles and create a visually appealing website.###2. E-commerce Website: Create a simple online store where users can browse products, add items to their cart, and complete the checkout process. Implement responsive design techniques to ensure the website looks and functions well on different devices. This project will give you hands-on experience with building responsive layouts for different screen sizes.###3. News Aggregator: Develop a web application that aggregates news articles from various sources and displays them in a user-friendly manner. Implement responsive design to ensure the content adapts well to different screen sizes and devices. This project will help you understand how to handle dynamic content and optimize it for responsiveness.",
   "Icons": "user-circle, shopping-cart, newspaper"
 }
]